#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/theredone-io/theredone-io/runs/run-PodbUiDaWmQQhs2V

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zones.domain_io: Reading...
cloudflare_pages_project.pages_project_io_settings: Refreshing state... [id=theredone-io]
data.cloudflare_zones.domain_io: Read complete after 0s [id=4183319ea34b85c69a202dd2c9a59462]
cloudflare_record.cname_root: Refreshing state... [id=99b462f4e083a456512fe7f9307e919c]
cloudflare_record.cname_www: Refreshing state... [id=54712ae50c0e9de4819a8d560efcf10e]
cloudflare_zone_settings_override.zone-io_settings: Refreshing state... [id=f3b1e19aad5e97136a0b477d7cbf7496]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.cname_root will be created
  + resource "cloudflare_record" "cname_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (sensitive)
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (sensitive)
      + zone_id         = "f3b1e19aad5e97136a0b477d7cbf7496"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pushed by: @claughinghouse, Action: `pull_request`*